package com.javarush.test.level03.lesson06.task01;

/* Мама мыла раму
Вывести на экран все возможные комбинации слов «Мама», «Мыла», «Раму».
Подсказка: их 6 штук. Каждую комбинацию вывести с новой строки. Слова не разделять. Пример:
МылаРамуМама
РамуМамаМыла
...
*/

public class Solution
{
    public static void main(String[] args)
    {
        System.out.println("МамаМылаРаму");//напишите тут ваш код
        System.out.println("МамаРамуМыла");//напишите тут ваш код
        System.out.println("МылаРамуМама");//напишите тут ваш код
        System.out.println("МылаМамаРаму");//напишите тут ваш код
        System.out.println("РамуМамаМыла");//напишите тут ваш код
        System.out.println("РамуМылаМама");//напишите тут ваш код




    }
}